config/gptel/sessions/commands.org
#+title: GPTEL Session Commands
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle commands.el
#+auto_tangle: y

* Introduction

User-facing commands for creating and managing gptel persistent sessions.

** Primary Workflow: Activities Integration

The *recommended workflow* for creating persistent gptel sessions is through the
=activities-extensions= package. When you create a new activity using the transient
UI (=M-x activities-ext-create=), you can optionally create a persistent gptel session
that is automatically integrated with the activity.

*** Creating an Activity with gptel Session

1. Run =M-x activities-ext-create= (or =C-x C-a C-e=)
2. Enter an activity name when prompted
3. In the transient menu:
   - Select projectile projects (optional)
   - Choose a gptel preset from =gptel--known-presets= (defaults to =executor=)
   - Ensure "Skip gptel session" (=-G=) is *not* toggled (gptel session created by default)
   - Press =RET= to create the activity

The gptel session will be:
- Created at =~/emacs-activities/<activity-slug-date>/session/=
- Configured with branch-based structure (=branches/main/= by default)
- Scope defined by preset's scope profile (written to =scope.yml=)
- Automatically opened in a split window alongside your org-roam document
- Stored in activity metadata for automatic resume

*** Resuming Activities with gptel Sessions

When you resume an activity (=M-x activities-resume=), the gptel session buffer is
automatically opened if one exists. The session state is restored from disk with
all conversation history preserved.

*** Session Directory Structure (Activities)

#+begin_example
~/emacs-activities/
└── my-feature-20260130/
    ├── session/
    │   ├── branches/
    │   │   └── main/
    │   │       ├── session.md        # Conversation history
    │   │       ├── scope.yml         # File access scope (from preset's scope profile)
    │   │       └── metadata.yml      # Session metadata (preset name, timestamps)
    │   ├── current -> branches/main
    │   └── gptel-logs.txt
    └── worktrees/
        └── project-name/             # Git worktrees (if using projectile)
#+end_example

** Alternative: Standalone Sessions

For sessions *outside* of activities, use =M-x jf/gptel-persistent-session=.
This is useful when you:
- Want a quick session without activity overhead
- Need a session not tied to a specific activity context
- Are working on ad-hoc tasks or experiments

Standalone sessions are stored in =~/.gptel/sessions/= by default.

See [[*Create Persistent Session][Create Persistent Session]] section below for details.

* Lexical Binding

#+begin_src emacs-lisp
;;; commands.el --- GPTEL Session Commands -*- lexical-binding: t; -*-

;; Copyright (C) 2024-2026 Jeff Farr

;;; Commentary:

;; Interactive commands for gptel session management.
;;
;; BREAKING CHANGE: Manual resume commands removed as of 2026-01-25
;; Sessions now auto-initialize when opened via find-file-hook
;; Users should open session files directly (C-x C-f, dired, recentf, etc.)
;; The jf/gptel-resume-session, jf/gptel-list-sessions, and jf/gptel-resume-agent
;; commands have been removed. Use standard Emacs file navigation instead.
;;
;; ARCHITECTURE: Presets are registered in gptel--known-presets at startup.
;; Session creation writes scope.yml (from preset's scope profile) and
;; metadata.yml (session metadata with preset name). On first open,
;; gptel--apply-preset applies the preset; after first save, upstream's
;; Local Variables + gptel--preset become the source of truth.

;;; Code:

(require 'cl-lib)
(require 'gptel)
(require 'gptel-session-constants)
(require 'gptel-session-logging)
(require 'gptel-session-filesystem)
(require 'gptel-session-registry)
(require 'gptel-session-metadata)
(require 'gptel-scope-profiles)
#+end_src

* Diagnostic and Maintenance Functions

Functions for debugging persistence issues and maintaining session health.

** Check for Duplicate Save Hooks

#+begin_src emacs-lisp
(defun jf/gptel--check-duplicate-hooks ()
  "Check if before-save-hook has duplicate gptel--save-state entries.
Returns the count of gptel--save-state hooks found."
  (interactive)
  (let* ((hooks (buffer-local-value 'before-save-hook (current-buffer)))
         (save-state-count (cl-count 'gptel--save-state hooks)))
    (message "before-save-hook has %d entries, %d are gptel--save-state"
             (length hooks) save-state-count)
    (when (> save-state-count 1)
      (warn "DUPLICATE HOOK DETECTED: gptel--save-state appears %d times!"
            save-state-count)
      (with-current-buffer (get-buffer-create "*Hook Duplicates*")
        (erase-buffer)
        (insert (format "Duplicate hooks detected in buffer: %s\n\n"
                        (buffer-name)))
        (insert (format "before-save-hook entries (%d total):\n" (length hooks)))
        (dolist (hook hooks)
          (insert (format "  - %s\n" hook)))
        (display-buffer (current-buffer))))
    save-state-count))
#+end_src

** Ensure gptel-mode Enabled Once

#+begin_src emacs-lisp
(defun jf/gptel--ensure-mode-once ()
  "Ensure gptel-mode is enabled exactly once with correct hooks.
Prevents duplicate before-save-hook entries that cause duplicate Local Variables."
  (unless gptel-mode
    (gptel-mode 1))

  ;; Defensive: Remove any duplicate hooks that might have accumulated
  (let ((hooks (buffer-local-value 'before-save-hook (current-buffer)))
        (count (cl-count 'gptel--save-state
                        (buffer-local-value 'before-save-hook (current-buffer)))))
    (when (> count 1)
      (jf/gptel--log 'warn "Removing %d duplicate gptel--save-state hooks" (1- count))
      ;; Remove all instances and re-add once
      (remove-hook 'before-save-hook #'gptel--save-state t)
      (add-hook 'before-save-hook #'gptel--save-state nil t))))
#+end_src

** Clean Duplicate Local Variables

#+begin_src emacs-lisp
(defun jf/gptel--clean-duplicate-local-vars ()
  "Remove all but the last Local Variables block in current buffer.
Useful for cleaning up files with duplicate blocks from previous bugs."
  (interactive)
  (save-excursion
    (save-restriction
      (widen)
      (goto-char (point-min))
      (let ((blocks nil)
            (changes 0))
        ;; Find all Local Variables blocks
        (while (re-search-forward "^<!-- Local Variables: -->$" nil t)
          (let ((start (match-beginning 0)))
            (when (re-search-forward "^<!-- End: -->$" nil t)
              (push (cons start (match-end 0)) blocks))))

        ;; If more than one block, delete all but the last
        (when (> (length blocks) 1)
          (setq blocks (nreverse blocks))  ; oldest first
          (dolist (block (butlast blocks))  ; all except last
            (delete-region (car block) (cdr block))
            (delete-blank-lines)
            (cl-incf changes))
          (message "Removed %d duplicate Local Variables block(s)" changes)
          (set-buffer-modified-p t)
          changes)))))
#+end_src

** Batch Clean All Session Files

#+begin_src emacs-lisp
(defun jf/gptel--batch-clean-sessions ()
  "Clean duplicate Local Variables from all session files.
Scans all sessions and removes duplicate blocks without opening buffers."
  (interactive)
  (let ((sessions (jf/gptel--find-all-sessions-recursive))
        (cleaned 0)
        (total 0))
    (dolist (session sessions)
      (let* ((session-dir (plist-get session :path))
             (session-file (jf/gptel--context-file-path session-dir)))
        (when (file-exists-p session-file)
          (cl-incf total)
          (with-temp-buffer
            (insert-file-contents session-file)
            (goto-char (point-min))
            (let ((block-count 0))
              (while (re-search-forward "^<!-- Local Variables: -->$" nil t)
                (cl-incf block-count))
              (when (> block-count 1)
                (erase-buffer)
                (insert-file-contents session-file)
                (goto-char (point-min))
                (let ((blocks nil))
                  (while (re-search-forward "^<!-- Local Variables: -->$" nil t)
                    (let ((start (match-beginning 0)))
                      (when (re-search-forward "^<!-- End: -->$" nil t)
                        (push (cons start (match-end 0)) blocks))))
                  (when (> (length blocks) 1)
                    (setq blocks (nreverse blocks))
                    (dolist (block (butlast blocks))
                      (delete-region (car block) (cdr block))
                      (delete-blank-lines))
                    (write-region (point-min) (point-max) session-file)
                    (cl-incf cleaned)
                    (jf/gptel--log 'info "Cleaned duplicates from: %s" session-file)))))))))
    (message "Cleaned %d of %d session files" cleaned total)))
#+end_src

* Auto-Initialization Hook

Function that detects and auto-initializes session files when opened via any method
(find-file, dired, recentf, etc.). This eliminates the need for manual resume commands.

