config/gptel/sessions/commands.el

(defun jf/gptel--create-session-core (session-id session-dir preset-name &optional initial-content worktree-paths project-root)
  "Create session directory structure with branching support.

SESSION-ID - unique session identifier
SESSION-DIR - parent directory for session (will contain branches/)
PRESET-NAME - symbol, name of registered preset in gptel--known-presets
INITIAL-CONTENT - optional initial content for session.md (default: \"###\\n\")
WORKTREE-PATHS - optional scope plist with explicit paths for activity isolation
PROJECT-ROOT - optional project root for scope profile variable expansion

Creates:
- SESSION-DIR/branches/main/ directory structure
- scope.yml (from preset's scope profile, or explicit worktree-paths)
- metadata.yml (session metadata with preset name)
- session.md (with initial content)
- current symlink pointing to main branch

Returns plist with:
  :session-id - session identifier
  :session-dir - session directory path
  :branch-dir - main branch directory path
  :branch-name - \"main\"
  :session-file - path to session.md"

  (let* ((main-branch-dir (jf/gptel--create-branch-directory session-dir "main"))
         (session-file (jf/gptel--context-file-path main-branch-dir))
         (initial-content (or initial-content "###\n")))

    ;; Write scope.yml from preset's scope profile
    (jf/gptel-scope-profile--create-for-session
     preset-name main-branch-dir project-root worktree-paths)

    ;; Write metadata.yml
    (let ((metadata-file (jf/gptel--metadata-file-path main-branch-dir))
          (timestamp (format-time-string "%Y-%m-%dT%H:%M:%SZ")))
      (with-temp-file metadata-file
        (insert (format "session_id: \"%s\"\n" session-id))
        (insert (format "created: \"%s\"\n" timestamp))
        (insert (format "updated: \"%s\"\n" timestamp))
        (insert (format "preset: \"%s\"\n" (symbol-name preset-name))))
      (jf/gptel--log 'info "Created metadata.yml: %s" metadata-file))

    ;; Create current symlink pointing to main
    (jf/gptel--update-current-symlink session-dir "main")

    ;; Create session file with initial content
    (with-temp-file session-file
      (insert initial-content))
    (jf/gptel--log 'info "Created session file: %s" session-file)

    ;; Return paths as plist
    (list :session-id session-id
          :session-dir session-dir
          :branch-dir main-branch-dir
          :branch-name "main"
          :session-file session-file)))

(defun jf/gptel-persistent-session (session-name &optional backend model preset-name)
  "Create a new persistent gptel session named SESSION-NAME.

Optional BACKEND and MODEL default to Claude Opus 4.5.
Optional PRESET-NAME specifies registered preset (default: 'executor).
With prefix argument (C-u), prompts to select preset interactively.

Prompts user to select projectile projects (0 or more).
If projects selected, first project is used as project-root for scope expansion.

Creates session with branches/main/ structure and current symlink.
The session auto-initializes when opened (via find-file-hook).

To open existing sessions: Just use find-file (C-x C-f) or dired on ~/.gptel/sessions/
No special resume command needed - sessions auto-initialize when opened."
  (interactive
   (let* ((name (read-string "Session name: "))
          (preset (if current-prefix-arg
                      (let* ((presets (mapcar #'car gptel--known-presets))
                             (annotator (lambda (name)
                                          (let* ((preset (gptel-get-preset (intern name)))
                                                 (desc (plist-get preset :description)))
                                            (when desc (format "  -- %s" desc)))))
                             (completion-extra-properties
                              (list :annotation-function annotator)))
                        (intern (completing-read "Select preset: "
                                                 (mapcar #'symbol-name presets)
                                                 nil t)))
                    'executor)))
     (list name nil nil preset)))
  (let* ((session-id (jf/gptel--generate-session-id session-name))
         (session-dir (jf/gptel--create-session-directory session-id))
         (preset-name (or preset-name 'executor))
         ;; Project selection
         (selected-projects (when (y-or-n-p "Select projectile projects for this session? ")
                             (jf/gptel--select-projects)))
         (project-root (when selected-projects (car selected-projects)))
         (project-names (when selected-projects
                         (mapcar #'jf/gptel--project-display-name selected-projects)))
         (initial-content (format "# %s\n\n" session-name)))

    ;; Create session structure using core helper
    (let* ((session-info (jf/gptel--create-session-core
                         session-id
                         session-dir
                         preset-name
                         initial-content
                         nil         ; no worktree-paths for standalone
                         project-root))
           (session-file (plist-get session-info :session-file)))

      ;; Open session file - auto-initialization hook will handle the rest
      (let ((buffer (find-file session-file)))
        (jf/gptel--log 'info "Created session: %s%s"
                      session-id
                      (if selected-projects
                          (format " with %d project(s)" (length selected-projects))
                        ""))
        (message "Created session: %s\nDirectory: %s\nBranch: main\nPreset: %s%s\n\nSession will auto-initialize when opened."
                 session-name
                 session-dir
                 preset-name
                 (if project-names
                     (format "\nProjects: %s" (string-join project-names ", "))
                   ""))
        buffer))))

(defun jf/gptel-refresh-sessions ()
  "Refresh the session registry by scanning session directories.
Useful if sessions were created outside Emacs or after startup."
  (interactive)
  (jf/gptel--init-registry)
  (message "Refreshed session registry: %d sessions found"
          (jf/gptel--session-count)))
